Revit 2027 API
RebarConstraint.SetDistanceToTargetRebar Method
 Sets the offset distance between the constrained RebarConstrainedHandle and its target Rebar handle surface.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetDistanceToTargetRebar(
	double distanceToTargetRebar
)
Public Sub SetDistanceToTargetRebar (
	distanceToTargetRebar As Double
)
public:
void SetDistanceToTargetRebar(
	double distanceToTargetRebar
)
member SetDistanceToTargetRebar :
        distanceToTargetRebar : float -> unit
Parameters
distanceToTargetRebar Double
 The distance is given as an offset value, the sign of which depends on the target bar handle direction.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The given value for distanceToTargetRebar must be no more than 30000 feet in absolute value.
InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- Constrained rebar isn't a Shape Driven Rebar element. -or- The TargetRebarConstraintType is 'HookBend' or 'BarBend'.
Remarks
Throws exception if the constraint is not to other rebar or if the target constraint is to bar bend or hook bend.
Throws exception if the constraint is for a handle of a Free Form Rebar.
See Also
Reference
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace